Revit 2027 API
FamilyParameter.IsDeterminedByFormula Property
Indicates if the parameter is determined by formula.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDeterminedByFormula { get; }
Public ReadOnly Property IsDeterminedByFormula As Boolean
	Get
public:
property bool IsDeterminedByFormula {
	bool get ();
}
member IsDeterminedByFormula : bool with get
Property Value
Boolean
Remarks
The parameter is read only if it is determined by formula.
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace